app/Controllers/Home.php

INSERT INTO `Persona` (`Id`, `Nombre`, `Edad`, `Ciudad`, `Ocupacion`, `Email`, `Telefono`) VALUES ('03', 'Juan Pérez', 40, 'Guayaquil', 'Empresario', 'jperez@example.com', '555-123-4567')
---
    public function insertarPersona()
    {
        $persona3 = array(
            'Id' => '03',
            'Nombre' => 'Juan Pérez',
            'Edad' => 40,
            'Ciudad' => 'Guayaquil',
            'Ocupacion' => 'Empresario',
            'Contacto' => array(
                'Email' => 'jperez@example.com',
                'Telefono' => '555-123-4567'
            )
        );

        // Extraer datos de contacto
        $email = $persona3['Contacto']['Email'];
        $telefono = $persona3['Contacto']['Telefono'];

        // Acceder a la base de datos
        $db = \Config\Database::connect();

        // Insertar persona en la base de datos
        $db->table('Persona')->insert([
            'Id' => $persona3['Id'],
            'Nombre' => $persona3['Nombre'],
            'Edad' => $persona3['Edad'],
            'Ciudad' => $persona3['Ciudad'],
            'Ocupacion' => $persona3['Ocupacion'],
            'Email' => $email,
            'Telefono' => $telefono,
        ]);